DataProcessors/НазначениеУслуг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<DataProcessor>
		<Properties>
			<Name>НазначениеУслуг</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФайлТарифы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНазначенияУслуги</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФайлПослуги</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНазначенияТарифа</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТабличнаяЧастьУслуги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Адрес</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УслугаСтарая</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЛицевойСчет</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Услуга1</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Услуга2</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Услуга3</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Услуга4</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Услуга5</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Услуга6</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Услуга7</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Услуга8</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Услуга9</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Услуга10</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Услуга11</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Услуга12</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ТабличнаяЧастьТарифы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Тариф</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТарифЛьготы</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НормаПотребления</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТарифПоНорме</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТарифПоНормеЛьгота</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

DataProcessors/НазначениеУслуг/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Процедура ФайлПослугиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Режим = РежимДиалогаВыбораФайла.Открытие;
	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(Режим);
	ДиалогОткрытияФайла.ПолноеИмяФайла = Объект.ФайлПослуги;
	Фильтр = "Электронная таблица Excel(*.xlsx)|*.xlsx";
	ДиалогОткрытияФайла.Фильтр = Фильтр;
	ДиалогОткрытияФайла.МножественныйВыбор = Ложь;
	ДиалогОткрытияФайла.Заголовок = НСтр("ru='Выберите файл';uk='Виберіть файл'");
	Если ДиалогОткрытияФайла.Выбрать() Тогда
		Объект.ФайлПослуги = ДиалогОткрытияФайла.ПолноеИмяФайла;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьУслуги(Команда)
	Путь = Объект.ФайлПослуги;
	Если НЕ ЗначениеЗаполнено(Объект.ФайлПослуги) Тогда
		Сообщить(НСтр("ru='Укажите путь к файлу.';uk='Вкажіть шлях до файлу.'"));
		Возврат;
	КонецЕсли;
	Если Объект.ТабличнаяЧастьУслуги.Количество() > 0 Тогда
		Ответ = Вопрос(НСтр("ru='Табличная часть будет очищена! Продолжить выполнение операции?';uk='Таблична частина буде очищена! Продовжити виконання операції'"), РежимДиалогаВопрос.ДаНет, 0);
		Если Ответ <> КодВозвратаДиалога.Да Тогда
			Возврат;
		КонецЕсли; 
	КонецЕсли;
	Объект.ТабличнаяЧастьУслуги.Очистить();
	Попытка
		Excel = Новый COMОбъект("Excel.application");	
	Исключение
		Сообщить(НСтр("ru='Не удалось подключиться';uk='Не вдалося підключитися'") + информацияОбОшибке());
		Возврат;
	КонецПопытки;
	
	Excel.Workbooks.Open(Путь);
	Sheet = Excel.Sheets(1);
	Sheet = Excel.ActiveWorkbook;
	КоличествоСтрок = Excel.ActiveSheet.UsedRange.Rows.Count();//Excel.Cells.CurrentRegion.Rows.Count;
	
	Для Счетчик = 2 По КоличествоСтрок Цикл
		НоваяСтрока                  = Объект.ТабличнаяЧастьУслуги.Добавить();
		НоваяСтрока.Адрес            = Excel.Cells(Счетчик, 1).Value;
		НоваяСтрока.УслугаСтарая     = Excel.Cells(Счетчик, 2).Value;
		НоваяСтрока.ЛицевойСчет      = Excel.Cells(Счетчик, 3).Value;
		НоваяСтрока.Услуга1          = Excel.Cells(Счетчик, 4).Value;
		НоваяСтрока.Услуга2          = Excel.Cells(Счетчик, 5).Value;
		НоваяСтрока.Услуга3          = Excel.Cells(Счетчик, 6).Value;
		НоваяСтрока.Услуга4          = Excel.Cells(Счетчик, 7).Value;
		НоваяСтрока.Услуга5          = Excel.Cells(Счетчик, 8).Value;
		НоваяСтрока.Услуга6          = Excel.Cells(Счетчик, 9).Value;
		НоваяСтрока.Услуга7          = Excel.Cells(Счетчик, 10).Value;
		НоваяСтрока.Услуга8          = Excel.Cells(Счетчик, 11).Value;
		НоваяСтрока.Услуга9          = Excel.Cells(Счетчик, 12).Value;
		НоваяСтрока.Услуга10         = Excel.Cells(Счетчик, 13).Value;
		НоваяСтрока.Услуга11         = Excel.Cells(Счетчик, 14).Value;
		НоваяСтрока.Услуга12         = Excel.Cells(Счетчик, 15).Value;
	КонецЦикла;
	Excel.Workbooks.Close();
	Excel.Quit();
КонецПроцедуры

&НаКлиенте
Процедура ФайлТарифыНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Режим = РежимДиалогаВыбораФайла.Открытие;
	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(Режим);
	ДиалогОткрытияФайла.ПолноеИмяФайла = Объект.ФайлТарифы;
	Фильтр = "Электронная таблица Excel(*.xlsx)|*.xlsx";
	ДиалогОткрытияФайла.Фильтр = Фильтр;
	ДиалогОткрытияФайла.МножественныйВыбор = Ложь;
	ДиалогОткрытияФайла.Заголовок = НСтр("ru='Выберите файл';uk='Виберіть файл'");
	Если ДиалогОткрытияФайла.Выбрать() Тогда
		Объект.ФайлТарифы = ДиалогОткрытияФайла.ПолноеИмяФайла;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьТарифы(Команда)
	Путь = Объект.ФайлТарифы;
	Если НЕ ЗначениеЗаполнено(Объект.ФайлТарифы) Тогда
		Сообщить(НСтр("ru='Укажите путь к файлу.';uk='Вкажіть шлях до файлу.'"));
		Возврат;
	КонецЕсли;
	Если Объект.ТабличнаяЧастьТарифы.Количество() > 0 Тогда
		Ответ = Вопрос(НСтр("ru='Табличная часть будет очищена! Продолжить выполнение операции?';uk='Таблична частина буде очищена! Продовжити виконання операції'"), РежимДиалогаВопрос.ДаНет, 0);
		Если Ответ <> КодВозвратаДиалога.Да Тогда
			Возврат;
		КонецЕсли; 
	КонецЕсли;
	Объект.ТабличнаяЧастьТарифы.Очистить();
	Попытка
		Excel = Новый COMОбъект("Excel.application");	
	Исключение
		Сообщить(НСтр("ru='Не удалось подключиться';uk='Не вдалося підключитися'") + информацияОбОшибке());
		Возврат;
	КонецПопытки;
	
	Excel.Workbooks.Open(Путь);
	Sheet = Excel.Sheets(1);
	Sheet = Excel.ActiveWorkbook;
	КоличествоСтрок = Excel.ActiveSheet.UsedRange.Rows.Count();//Excel.Cells.CurrentRegion.Rows.Count;
	
	Для Счетчик = 2 По КоличествоСтрок Цикл
		НоваяСтрока                  = Объект.ТабличнаяЧастьТарифы.Добавить();
		НоваяСтрока.Услуга           = Excel.Cells(Счетчик, 1).Value;
		НоваяСтрока.Тариф            = Excel.Cells(Счетчик, 2).Value;
		НоваяСтрока.ТарифЛьготы      = Excel.Cells(Счетчик, 3).Value;
		НоваяСтрока.НормаПотребления = Excel.Cells(Счетчик, 4).Value;
		НоваяСтрока.ТарифПоНорме     = Excel.Cells(Счетчик, 5).Value;
		НоваяСтрока.ТарифПоНормеЛьгота = Excel.Cells(Счетчик, 6).Value;
	КонецЦикла;
	Excel.Workbooks.Close();
	Excel.Quit();
КонецПроцедуры

&НаСервере
Процедура УстановитьТарифыПоУслугамНаСервере()
	// Создадим тз Зданий из таблицы Услуги
	тзЗдания = Новый ТаблицаЗначений;
	тзЗдания.Колонки.Добавить("Здание",,"Здание");
	тзЗдания.Колонки.Добавить("Число", Новый ОписаниеТипов("Число"), "Число");
	Здание = Справочники.ЗданияИСооружения.ПустаяСсылка();
	Для Каждого стр Из Объект.ТабличнаяЧастьУслуги Цикл
		ЛС = НайтиЛицевойСчет(СтрЗаменить(Строка(стр.ЛицевойСчет), Символы.НПП, ""));
		Если ЛС <> Неопределено Тогда
			Здание_ = ЛС.Владелец;
			Если Здание <> Здание_ Тогда
				НовСтрока = тзЗдания.Добавить();
				НовСтрока.Число = 1;
				НовСтрока.Здание = Здание_;
				Здание = Здание_;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	тзЗдания.Свернуть("Здание", "Число");
	
	Для Каждого стрЗдания Из тзЗдания Цикл
		Запрос = Новый Запрос;
		Запрос.Текст =
		    "ВЫБРАТЬ
		    |	УправлениеТарифами.Ссылка
		    |ИЗ
		    |	Документ.УправлениеТарифами КАК УправлениеТарифами
		    |ГДЕ
		    |	УправлениеТарифами.Дата МЕЖДУ &ДатаНач И &ДатаКон
		    |	И УправлениеТарифами.Проведен = ИСТИНА
		    |	И УправлениеТарифами.Здание = &Здание";
		Запрос.УстановитьПараметр("ДатаНач", НачалоДня(Объект.ДатаНазначенияТарифа));
		Запрос.УстановитьПараметр("ДатаКон", КонецДня(Объект.ДатаНазначенияТарифа));
		Запрос.УстановитьПараметр("Здание",стрЗдания.Здание);
		Результат = Запрос.Выполнить();
		Если НЕ Результат.Пустой() Тогда
			Выборка = Результат.Выбрать();
			Пока Выборка.Следующий()Цикл
				Отбор = Новый Структура;
				Отбор.Вставить("Услуга", Справочники.Услуги.НайтиПоКоду("000000048"));
				Док = Выборка.Ссылка.ПолучитьОбъект();
				ТаблицаТарифы = Док.Тарифы;
				МассивСтрок = ТаблицаТарифы.НайтиСтроки(Отбор);
				Для Каждого стрТариф Из МассивСтрок Цикл
					стрТариф.ЗначениеТарифа = 22.92;
					стрТариф.ЗначениеТарифаЛьгота = 22.92;
				КонецЦикла;
				Попытка
				    Док.Записать(РежимзаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
				Исключение
					Док.Записать();
					Сообщить("Не удалось записать документ " + Док.Ссылка);
				КонецПопытки;
			КонецЦикла;		
		КонецЕсли;
		
		// Отменим закрытие месяца
		ЗапросЗакрМес = Новый Запрос;
		ЗапросЗакрМес.Текст = 
		    "ВЫБРАТЬ
		    |	ЗакрытиеМесяца.Ссылка
		    |ИЗ
		    |	Документ.ЗакрытиеМесяца КАК ЗакрытиеМесяца
		    |ГДЕ
		    |	ЗакрытиеМесяца.Проведен = ИСТИНА
		    |	И ЗакрытиеМесяца.Здание = &Здание
		    |	И ЗакрытиеМесяца.Дата = &Дата";
		ЗапросЗакрМес.УстановитьПараметр("Здание", стрЗдания.Здание);
		ЗапросЗакрМес.УстановитьПараметр("Дата", КонецМесяца(Объект.ДатаНазначенияТарифа));
		Результат = ЗапросЗакрМес.Выполнить();
		Если НЕ Результат.Пустой() Тогда
			Выборка = Результат.Выбрать();
			Пока Выборка.Следующий() Цикл
			    ОбъектЗакрМес = Выборка.Ссылка.ПолучитьОбъект();
				ОбъектЗакрМес.Записать(РежимЗаписиДокумента.ОтменаПроведения);
			КонецЦикла;
		КонецЕсли;
		
		// Проведем переначисление по лицевому счету
		ЗапросНачисления = Новый Запрос;
		ЗапросНачисления.Текст =
		    "ВЫБРАТЬ
		    |	НачислениеПоЛС.Ссылка,
		    |	НачислениеПоЛС.Проведен
		    |ИЗ
		    |	Документ.НачислениеПоЛС КАК НачислениеПоЛС
		    |ГДЕ
		    |	НачислениеПоЛС.ПериодНачисления = &ПериодНачисления
		    |	И НачислениеПоЛС.Проведен = ИСТИНА
		    |	И НачислениеПоЛС.Здание = &Здание";
		ЗапросНачисления.УстановитьПараметр("ПериодНачисления", НачалоМесяца(Объект.ДатаНазначенияТарифа));
		ЗапросНачисления.УстановитьПараметр("Здание", стрЗдания.Здание);
		Результат = ЗапросНачисления.Выполнить();
		Если Не Результат.Пустой() Тогда
			Выборка = Результат.Выбрать();
			Пока Выборка.Следующий() Цикл
				ОбъектНачисления = Выборка.Ссылка.ПолучитьОбъект();
				ОбъектНачисления.Записать(РежимЗаписиДокумента.ОтменаПроведения);
				ОбъектНачисления.ЗаполнитьАвтоматическиНаСервере();
				Попытка
				    ОбъектНачисления.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
				Исключение
					Сообщить("Не вдалося провести документ начисление " + ОбъектНачисления.Ссылка);
				КонецПопытки;	
			КонецЦикла;
		КонецЕсли;
		
		Если ОбъектНачисления.Проведен = Истина Тогда
			Попытка
			    ОбъектЗакрМес.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
			Исключение
				Сообщить("Не вдалося провести документ закрытие меняца " + ОбъектЗакрМес.Ссылка);
			КонецПопытки;
        КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура УстановитьТарифыПоУслугам(Команда)
	Если Объект.ТабличнаяЧастьУслуги.Количество() = 0 Тогда
		Сообщить("Таблиця ""Послуги"" пуста. Заповнення не можливе!");
		Возврат;
	КонецЕсли;
	Если Объект.ТабличнаяЧастьТарифы.Количество() = 0 Тогда
		Сообщить("Таблиця ""Тарифи"" пуста. Заповнення не можливе!");
		Возврат;
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(Объект.ДатаНазначенияТарифа) Тогда
		Сообщить("Дата призначення тарифа пуста!");
		Возврат;
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(Объект.ДатаНазначенияУслуги) Тогда
		Сообщить("Дата призначення послуги пуста");
		Возврат;
	КонецЕсли;
	УстановитьТарифыПоУслугамНаСервере();
КонецПроцедуры

&НаСервере
Функция НайтиЛицевойСчет(ЛицевойСчет)
	Запрос = Новый Запрос;
	Запрос.Текст = 
	    "ВЫБРАТЬ
	    |	ЛицевыеСчетаСрезПоследних.ЛицевойСчет КАК ЛицевойСчет
	    |ИЗ
	    |	РегистрСведений.ЛицевыеСчета.СрезПоследних(&НаДату, ЛицевойСчет.Наименование = &ЛицевойСчет И Действует = ИСТИНА) КАК ЛицевыеСчетаСрезПоследних";
	Запрос.УстановитьПараметр("НаДату", Новый Граница(ТекущаяДата(), ВидГраницы.Включая));
	Запрос.УстановитьПараметр("ЛицевойСчет", ЛицевойСчет);
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		ЛС = Выборка.ЛицевойСчет;
	КонецЦикла;
	Возврат ЛС;
КонецФункции
